demo/app/Controllers/Students.php

    public function index()
    {
        // Fetch all students from the database
        $model = new Student();
        $students = $model->findAll();
---
SELECT *
FROM `students`

    public function show($id = null)
    {
        // Fetch a specific student by ID from the database
        $model = new Student();
        $student = $model->find($id);
---
SELECT *
FROM `students`
WHERE `students`.`id` = '6'

    public function create()
    {
        // Handle the creation of a new student
        $model = new Student();

        $data = $this->request->getPost();
        $result = $model->insert($data);
---
INSERT INTO `students` (`name`, `email`) VALUES ('Haykal', 'haykal@gmail.com')

    public function delete($id = null)
    {
        // Handle deleting a student
        $model = new Student();

        $deleted = $model->delete($id);
---
DELETE FROM `students`
WHERE `id` IN ('7')